# Welcome to the ending of your second module at KS :)

The sharing of this workbook entails that you are moving on a good pace ðŸ¥° Let's jump on to some advance stuff now, eh?

R E M E M B E R:       **PANDAS** documentation is going to be your bestie for this assignment!

### **PART 1 - GET TO KNOW YOUR DATA!**

This time we are going to pull data directly from the internet.

Step 1: Import the neccessary libraries.

In [5]:
import numpy as np
import pandas as pd

Step 2: Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv) and save it in a variable named food.

In [6]:
#Hint: to get the date, check what sort of delimiter would you use?
food = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv' , sep="\t")

Step 3: I want to see what the first ten rows of the dataset looks like. How?

In [7]:
food.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

Step 4. What is the number of observations in the dataset?

In [8]:
num_rows = len(food)
print(f"Number of observations: {num_rows}")

Number of observations: 4622

Step 5. What is the number of columns in the dataset?

In [9]:
no_of_columns = food.shape[1]
print(f"Number of Columns: {no_of_columns}")

Number of Columns: 5

Step 6. Print the name of all the columns.

In [10]:
food.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

Step 7. How is the dataset indexed?

In [11]:
#Hint: think or look for a command that gives information about the dataset but this time, only the index from the dataset.
food.index

RangeIndex(start=0, stop=4622, step=1)

Step 8. Which was the most-ordered item?

In [12]:
most_ordered = food.groupby('item_name')['quantity'].agg(sum).reset_index()

#Most order item

most_ordered_item = most_ordered.loc[most_ordered['quantity'].idxmax()]
print(f'The Most ordered item was: {most_ordered_item[0]}')

The Most ordered item was: Chicken Bowl

Step 9. For the most-ordered item, how many items were ordered?

In [13]:
print(f'The {most_ordered_item[0]} was order: {most_ordered_item[1]} times')

The Chicken Bowl was order: 761 times

Step 10. What was the most ordered item in the choice_description column?

In [14]:
most_ordered_choice = food['choice_description'].value_counts().reset_index()

# Rename columns from index	choice_description to 'choice_description', 'count'
most_ordered_choice.columns = ['choice_description', 'count']
most_ordered_choice_description = most_ordered_choice.loc[most_ordered_choice['count'].idxmax()]
print(f'The {most_ordered_choice_description[0]} was order: {most_ordered_choice_description[1]} times')

The [Diet Coke] was order: 134 times

Step 11. How many items were orderd in total?

In [15]:
total_items_ordered = food['quantity'].sum()
print(f"Total number of items ordered: {total_items_ordered}")

Total number of items ordered: 4972

Step 12. Turn the item price into a float

Step 12.a. Check the item price type

In [16]:
#check itemprice type before changing  it
food['item_price'].dtypes

dtype('O')

Step 12.b. Create a lambda function and change the type of item price.

In [17]:
#Hint: You can first create a lambda function and then store it in a variable. After that, you can (APPLY) it on the relevant column :)
# lambda function to convert item price to float
convert_price = lambda x: float(x.replace('$', ''))

# Apply the lambda function to the item_price column
food['item_price'] = food['item_price'].apply(convert_price)

Step 12.c. Check the item price type now

In [18]:
#make sure the itemprice type has changed now
food['item_price'].dtypes

dtype('float64')

Step 13. How much was the revenue for the period in the dataset?

In [19]:
#Hint: Revenue = Quantity into ItemPrice
food['Revenue'] = food['quantity'] * food['item_price']
total_revenue = food['Revenue'].sum()
print(f'The revenue for the period in the dataset was: {total_revenue}')

The revenue for the period in the dataset was: 39237.02

Step 14. How many orders were made in the period?

In [20]:
total_orders = food['order_id'].nunique()
print(f'Total no of orders made in the period were : {total_orders}')

Total no of orders made in the period were : 1834

Step 15. What is the average revenue amount per order?

In [21]:
average_revenue = total_revenue/total_orders
print(f"Average revenue per order: ${average_revenue:.2f}")

Average revenue per order: $21.39

Step 16. How many different items are sold?

In [22]:
# Count the unique item names
total_unique_items = food['item_name'].nunique()

# total number of different items sold
print(f"Total number of different items sold: {total_unique_items}")

Total number of different items sold: 50

### **Part 2 - FILTER AND SORT YOUR DATA!**

Step 17. How many products cost more than $10.00?

In [23]:
# you already  converted the itemprice into flaot, now delete the duplicates in item_name and quantity.
# select only the products with quantity equals to 1 and then print the unqiue count only

# Remove duplicates based on item_name and quantity
food_unique = food.drop_duplicates(subset=['item_name', 'quantity'])

# Select products with quantity equals to 1
food_quantity_one = food_unique[food_unique['quantity'] == 1]

# Filter products costing more than $10.00
food_costly_products = food_quantity_one[food_quantity_one['item_price'] > 10.00]

# Count the unique items
total_expensive_products = food_costly_products['item_name'].nunique()

# Display the count of unique products costing more than $10.00
print(f"Total number of different products costing more than $10.00: {total_expensive_products}")

Total number of different products costing more than $10.00: 12

Step 18. Sort by the name of the item

In [24]:
sorted_food_costly_products = food_costly_products.sort_values(by='item_name')
sorted_food_costly_products

,order_id,quantity,item_name,choice_description,item_price,Revenue
39,19,1,Barbacoa Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",11.75,11.75
168,75,1,Barbacoa Crispy Tacos,"[Tomatillo Red Chili Salsa, [Rice, Black Beans...",11.75,11.75
1229,501,1,Barbacoa Salad Bowl,"[Fresh Tomato Salsa, [Rice, Fajita Vegetables,...",11.89,11.89
1132,468,1,Carnitas Salad Bowl,"[Fresh Tomato Salsa, [Rice, Black Beans, Chees...",11.89,11.89
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98,10.98
250,109,1,Chicken Salad,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",10.98,10.98
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.75,11.75
606,250,1,Steak Salad Bowl,"[Fresh Tomato Salsa, [Pinto Beans, Cheese, Gua...",11.89,11.89
62,28,1,Veggie Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25,11.25
57,26,1,Veggie Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.25,11.25
186,83,1,Veggie Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25,11.25
738,304,1,Veggie Soft Tacos,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.25,11.25

Step 19. What was the quantity of the most expensive item ordered?

In [25]:
# Find the row with the most expensive item
most_expensive_item = food.loc[food['item_price'].idxmax()]

# Retrieve the quantity of the most expensive item
most_expensive_item_quantity = most_expensive_item['quantity']

# Display the most expensive item details and its quantity
print(f"The most expensive item ordered is: {most_expensive_item['item_name']}")
print(f"Quantity of the most expensive item ordered: {most_expensive_item_quantity}")

The most expensive item ordered is: Chips and Fresh Tomato Salsa
Quantity of the most expensive item ordered: 15

Step 20. How many times did someone order more than one Canned Soda?

In [26]:
#Hint: you can also use boolean condition
canned_soda_orders = food[(food['item_name'] == 'Canned Soda') & (food['quantity'] > 1)]

# Count the occurrences
number_of_canned_soda_orders = len(canned_soda_orders)

# Display the number of times more than one Canned Soda was ordered
print(f"Number of times more than one Canned Soda was ordered: {number_of_canned_soda_orders}")

Number of times more than one Canned Soda was ordered: 20

BONUS QUESTION: Pandas is used for Data Analysis. Create some unique pandas insight from your dataset and code it here.

Bonus Question is optional, but attempting it would result in 5 Grace Points :)

### Top 5 Items by Quantity Sold

In [27]:
# Group by item_name and sum the quantity
quantity_per_item = food.groupby('item_name')['quantity'].sum().sort_values(ascending=False)

# Display the top 5 items by quantity sold
top_5_items_by_quantity = quantity_per_item.head(5)

print("Top 5 items by quantity sold:")
print(top_5_items_by_quantity)

Top 5 items by quantity sold:
item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

### Most Popular Item by Revenue

In [28]:
# Group by item_name and sum the revenue
revenue_per_item = food.groupby('item_name')['Revenue'].sum().sort_values(ascending=False)

# Display the most popular item by revenue
most_popular_item_by_revenue = revenue_per_item.idxmax()
most_popular_item_revenue = revenue_per_item.max()

print(f"The most popular item by revenue is: {most_popular_item_by_revenue} with a total revenue of ${most_popular_item_revenue:.2f}")

The most popular item by revenue is: Chicken Bowl with a total revenue of $8044.63

### **THE END!!!**
or maybe not :)

We still need to practice Grouping more.

### **PART 3 - GROUPING!!**

But now, we will be changing our dataset a bit. Get your dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user) and store it in a variable called users.

In [29]:
#Hint: this time, you may need to change your choice of delimieter. Check and see how the values are being seperated.
#Also this time, be on a lookout of what column would you use as an index?
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user' , delimiter='|', index_col='user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

Step 1. Discover what is the mean age per occupation

In [30]:
mean_age_per_occupation = users.groupby('occupation')['age'].mean()
mean_age_per_occupation

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

Step 2. Discover the Male ratio per occupation and sort it from the most to the least

In [31]:
#The output of this cell is given below. Your output should match this!
# Create a new column for gender as binary (1 for male, 0 for female)
users['gender_binary'] = users['gender'].apply(lambda x: 1 if x == 'M' else 0)

# Group by occupation and calculate the male ratio
male_ratio_per_occupation = users.groupby('occupation')['gender_binary'].mean()*100

# Sort the results from most to least
sorted_male_ratio = male_ratio_per_occupation.sort_values(ascending=False)

# Display the sorted male ratio per occupation
print(sorted_male_ratio)

occupation
doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
Name: gender_binary, dtype: float64

![ig1.png]()

Step 3. For each occupation, calculate the minimum and maximum ages

In [32]:
# Group by occupation and calculate the minimum and maximum ages
min_max_age_per_occupation = users.groupby('occupation')['age'].agg(['min', 'max'])

# Display the minimum and maximum ages for each occupation
print(min_max_age_per_occupation)

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

Step 4.  For each combination of occupation and gender, calculate the mean age

In [33]:
# Group by occupation and gender, then calculate the mean age
mean_age_per_occupation_gender = users.groupby(['occupation', 'gender'])['age'].mean()

# Display the mean age for each combination of occupation and gender
print(mean_age_per_occupation_gender)

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

Step 5. For each occupation present the percentage of women and men

In [34]:
# Count the number of men and women for each occupation
gender_count_per_occupation = users.groupby(['occupation', 'gender']).size().unstack(fill_value=0)

# Count the total number of people for each occupation
total_count_per_occupation = users.groupby('occupation').size()

# Calculate the percentage of men and women for each occupation
gender_percentage_per_occupation = (gender_count_per_occupation.T / total_count_per_occupation).T * 100

# Display the percentage of men and women for each occupation
print(gender_percentage_per_occupation)

gender                 F           M
occupation
administrator  45.569620   54.430380
artist         46.428571   53.571429
doctor          0.000000  100.000000
educator       27.368421   72.631579
engineer        2.985075   97.014925
entertainment  11.111111   88.888889
executive       9.375000   90.625000
healthcare     68.750000   31.250000
homemaker      85.714286   14.285714
lawyer         16.666667   83.333333
librarian      56.862745   43.137255
marketing      38.461538   61.538462
none           44.444444   55.555556
other          34.285714   65.714286
programmer      9.090909   90.909091
retired         7.142857   92.857143
salesman       25.000000   75.000000
scientist       9.677419   90.322581
student        30.612245   69.387755
technician      3.703704   96.296296
writer         42.222222   57.777778

Easy, right? I knew you could do it ðŸ’¯

You are just left with 2 modules :)

### **PART 4 - APPLY**

Get your data from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv) and store it in a variable called crime

In [35]:
#read your data and display first 5 rows
crime = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv' )
crime.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

Step 1. What is the type of the columns?

In [36]:
col = crime.columns
col.dtype

dtype('O')

Step 2. Convert the type of the column Year to datetime64

In [37]:
crime['Year'] = pd.to_datetime(crime['Year'] , format='%Y')

Step 3. Set the Year column as the index of the dataframe

In [38]:
crime.set_index('Year' , inplace=True)
crime

,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,,
1960-01-01,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1961-01-01,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
1962-01-01,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
1963-01-01,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
1964-01-01,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800
1965-01-01,193526000,4739400,387390,4352000,9960,23410,138690,215330,1282500,2572600,496900
1966-01-01,195576000,5223500,430180,4793300,11040,25820,157990,235330,1410100,2822000,561200
1967-01-01,197457000,5903400,499930,5403500,12240,27620,202910,257160,1632100,3111600,659800
1968-01-01,199399000,6720200,595010,6125200,13800,31670,262840,286700,1858900,3482700,783600
1969-01-01,201385000,7410900,661870,6749000,14760,37170,298850,311090,1981900,3888600,878500
1970-01-01,203235298,8098000,738820,7359200,16000,37990,349860,334970,2205000,4225800,928400
1971-01-01,206212000,8588200,816500,7771700,17780,42260,387700,368760,2399300,4424200,948200
1972-01-01,208230000,8248800,834900,7413900,18670,46850,376290,393090,2375500,4151200,887200
1973-01-01,209851000,8718100,875910,7842200,19640,51400,384220,420650,2565500,4347900,928800
1974-01-01,211392000,10253400,974720,9278700,20710,55400,442400,456210,3039200,5262500,977100
1975-01-01,213124000,11292400,1039710,10252700,20510,56090,470500,492620,3265300,5977700,1009600
1976-01-01,214659000,11349700,1004210,10345500,18780,57080,427810,500530,3108700,6270800,966000
1977-01-01,216332000,10984500,1029580,9955000,19120,63500,412610,534350,3071500,5905700,977700
1978-01-01,218059000,11209000,1085550,10123400,19560,67610,426930,571460,3128300,5991000,1004100
1979-01-01,220099000,12249500,1208030,11041500,21460,76390,480700,629480,3327700,6601000,1112800
1980-01-01,225349264,13408300,1344520,12063700,23040,82990,565840,672650,3795200,7136900,1131700
1981-01-01,229146000,13423800,1361820,12061900,22520,82500,592910,663900,3779700,7194400,1087800
1982-01-01,231534000,12974400,1322390,11652000,21010,78770,553130,669480,3447100,7142500,1062400
1983-01-01,233981000,12108600,1258090,10850500,19310,78920,506570,653290,3129900,6712800,1007900
1984-01-01,236158000,11881800,1273280,10608500,18690,84230,485010,685350,2984400,6591900,1032200
1985-01-01,238740000,12431400,1328800,11102600,18980,88670,497870,723250,3073300,6926400,1102900
1986-01-01,240132887,13211869,1489169,11722700,20613,91459,542775,834322,3241410,7257153,1224137
1987-01-01,242282918,13508700,1483999,12024700,20096,91110,517704,855088,3236184,7499900,1288674
1988-01-01,245807000,13923100,1566220,12356900,20680,92490,542970,910090,3218100,7705900,1432900
1989-01-01,248239000,14251400,1646040,12605400,21500,94500,578330,951710,3168200,7872400,1564800
1990-01-01,248709873,14475600,1820130,12655500,23440,102560,639270,1054860,3073900,7945700,1635900
1991-01-01,252177000,14872900,1911770,12961100,24700,106590,687730,1092740,3157200,8142200,1661700
1992-01-01,255082000,14438200,1932270,12505900,23760,109060,672480,1126970,2979900,7915200,1610800
1993-01-01,257908000,14144800,1926020,12218800,24530,106010,659870,1135610,2834800,7820900,1563100
1994-01-01,260341000,13989500,1857670,12131900,23330,102220,618950,1113180,2712800,7879800,1539300
1995-01-01,262755000,13862700,1798790,12063900,21610,97470,580510,1099210,2593800,7997700,1472400
1996-01-01,265228572,13493863,1688540,11805300,19650,96250,535590,1037050,2506400,7904700,1394200
1997-01-01,267637000,13194571,1634770,11558175,18208,96153,498534,1023201,2460526,7743760,1354189
1998-01-01,270296000,12475634,1531044,10944590,16914,93103,446625,974402,2329950,7373886,1240754
1999-01-01,272690813,11634378,1426044,10208334,15522,89411,409371,911740,2100739,6955520,1152075
2000-01-01,281421906,11608072,1425486,10182586,15586,90178,408016,911706,2050992,6971590,1160002
2001-01-01,285317559,11876669,1439480,10437480,16037,90863,423557,909023,2116531,7092267,1228391
2002-01-01,287973924,11878954,1423677,10455277,16229,95235,420806,891407,2151252,7057370,1246646
2003-01-01,290690788,11826538,1383676,10442862,16528,93883,414235,859030,2154834,7026802,1261226
2004-01-01,293656842,11679474,1360088,10319386,16148,95089,401470,847381,2144446,6937089,1237851
2005-01-01,296507061,11565499,1390745,10174754,16740,94347,417438,862220,2155448,6783447,1235859
2006-01-01,299398484,11401511,1418043,9983568,17030,92757,447403,860853,2183746,6607013,1192809
2007-01-01,301621157,11251828,1408337,9843481,16929,90427,445125,855856,2176140,6568572,1095769
2008-01-01,304374846,11160543,1392628,9767915,16442,90479,443574,842134,2228474,6588046,958629
2009-01-01,307006550,10762956,1325896,9337060,15399,89241,408742,812514,2203313,6338095,795652
2010-01-01,309330219,10363873,1251248,9112625,14772,85593,369089,781844,2168457,6204601,739565
2011-01-01,311587816,10258774,1206031,9052743,14661,84175,354772,752423,2185140,6151095,716508
2012-01-01,313873685,10219059,1217067,9001992,14866,85141,355051,762009,2109932,6168874,723186
2013-01-01,316497531,9850445,1199684,8650761,14319,82109,345095,726575,1931835,6018632,700294
2014-01-01,318857056,9475816,1197987,8277829,14249,84041,325802,741291,1729806,5858496,689527

Step 4. Delete the Total column

In [39]:
crime.drop(columns='Total')

,Population,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,
1960-01-01,179323175,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1961-01-01,182992000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
1962-01-01,185771000,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
1963-01-01,188483000,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
1964-01-01,191141000,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800
1965-01-01,193526000,387390,4352000,9960,23410,138690,215330,1282500,2572600,496900
1966-01-01,195576000,430180,4793300,11040,25820,157990,235330,1410100,2822000,561200
1967-01-01,197457000,499930,5403500,12240,27620,202910,257160,1632100,3111600,659800
1968-01-01,199399000,595010,6125200,13800,31670,262840,286700,1858900,3482700,783600
1969-01-01,201385000,661870,6749000,14760,37170,298850,311090,1981900,3888600,878500
1970-01-01,203235298,738820,7359200,16000,37990,349860,334970,2205000,4225800,928400
1971-01-01,206212000,816500,7771700,17780,42260,387700,368760,2399300,4424200,948200
1972-01-01,208230000,834900,7413900,18670,46850,376290,393090,2375500,4151200,887200
1973-01-01,209851000,875910,7842200,19640,51400,384220,420650,2565500,4347900,928800
1974-01-01,211392000,974720,9278700,20710,55400,442400,456210,3039200,5262500,977100
1975-01-01,213124000,1039710,10252700,20510,56090,470500,492620,3265300,5977700,1009600
1976-01-01,214659000,1004210,10345500,18780,57080,427810,500530,3108700,6270800,966000
1977-01-01,216332000,1029580,9955000,19120,63500,412610,534350,3071500,5905700,977700
1978-01-01,218059000,1085550,10123400,19560,67610,426930,571460,3128300,5991000,1004100
1979-01-01,220099000,1208030,11041500,21460,76390,480700,629480,3327700,6601000,1112800
1980-01-01,225349264,1344520,12063700,23040,82990,565840,672650,3795200,7136900,1131700
1981-01-01,229146000,1361820,12061900,22520,82500,592910,663900,3779700,7194400,1087800
1982-01-01,231534000,1322390,11652000,21010,78770,553130,669480,3447100,7142500,1062400
1983-01-01,233981000,1258090,10850500,19310,78920,506570,653290,3129900,6712800,1007900
1984-01-01,236158000,1273280,10608500,18690,84230,485010,685350,2984400,6591900,1032200
1985-01-01,238740000,1328800,11102600,18980,88670,497870,723250,3073300,6926400,1102900
1986-01-01,240132887,1489169,11722700,20613,91459,542775,834322,3241410,7257153,1224137
1987-01-01,242282918,1483999,12024700,20096,91110,517704,855088,3236184,7499900,1288674
1988-01-01,245807000,1566220,12356900,20680,92490,542970,910090,3218100,7705900,1432900
1989-01-01,248239000,1646040,12605400,21500,94500,578330,951710,3168200,7872400,1564800
1990-01-01,248709873,1820130,12655500,23440,102560,639270,1054860,3073900,7945700,1635900
1991-01-01,252177000,1911770,12961100,24700,106590,687730,1092740,3157200,8142200,1661700
1992-01-01,255082000,1932270,12505900,23760,109060,672480,1126970,2979900,7915200,1610800
1993-01-01,257908000,1926020,12218800,24530,106010,659870,1135610,2834800,7820900,1563100
1994-01-01,260341000,1857670,12131900,23330,102220,618950,1113180,2712800,7879800,1539300
1995-01-01,262755000,1798790,12063900,21610,97470,580510,1099210,2593800,7997700,1472400
1996-01-01,265228572,1688540,11805300,19650,96250,535590,1037050,2506400,7904700,1394200
1997-01-01,267637000,1634770,11558175,18208,96153,498534,1023201,2460526,7743760,1354189
1998-01-01,270296000,1531044,10944590,16914,93103,446625,974402,2329950,7373886,1240754
1999-01-01,272690813,1426044,10208334,15522,89411,409371,911740,2100739,6955520,1152075
2000-01-01,281421906,1425486,10182586,15586,90178,408016,911706,2050992,6971590,1160002
2001-01-01,285317559,1439480,10437480,16037,90863,423557,909023,2116531,7092267,1228391
2002-01-01,287973924,1423677,10455277,16229,95235,420806,891407,2151252,7057370,1246646
2003-01-01,290690788,1383676,10442862,16528,93883,414235,859030,2154834,7026802,1261226
2004-01-01,293656842,1360088,10319386,16148,95089,401470,847381,2144446,6937089,1237851
2005-01-01,296507061,1390745,10174754,16740,94347,417438,862220,2155448,6783447,1235859
2006-01-01,299398484,1418043,9983568,17030,92757,447403,860853,2183746,6607013,1192809
2007-01-01,301621157,1408337,9843481,16929,90427,445125,855856,2176140,6568572,1095769
2008-01-01,304374846,1392628,9767915,16442,90479,443574,842134,2228474,6588046,958629
2009-01-01,307006550,1325896,9337060,15399,89241,408742,812514,2203313,6338095,795652
2010-01-01,309330219,1251248,9112625,14772,85593,369089,781844,2168457,6204601,739565
2011-01-01,311587816,1206031,9052743,14661,84175,354772,752423,2185140,6151095,716508
2012-01-01,313873685,1217067,9001992,14866,85141,355051,762009,2109932,6168874,723186
2013-01-01,316497531,1199684,8650761,14319,82109,345095,726575,1931835,6018632,700294
2014-01-01,318857056,1197987,8277829,14249,84041,325802,741291,1729806,5858496,689527

Step 5. Group the year by decades and sum the values.

***Pay attention to the Population column number, summing this column is a mistake***

In [40]:
# To learn more about .resample (https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.resample.html)
# To learn more about Offset Aliases (http://pandas.pydata.org/pandas-docs/stable/timeseries.html#offset-aliases)

# Uses resample to sum each decade
decade_sum = crime.resample('10AS').sum()

# Uses resample to get the max value only for the "Population" column
decade_population_max = crime['Population'].resample('10AS').max()

# Updating the "Population" column
decade_sum['Population'] = decade_population_max
decade_sum

,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
Year,,,,,,,,,,,
1960-01-01,201385000,49295900,4134930,45160900,106180,236720,1633510,2158520,13321100,26547700,5292100
1970-01-01,220099000,100991600,9607930,91383800,192230,554570,4159020,4702120,28486000,53157800,9739900
1980-01-01,248239000,131123369,14074328,117048900,206439,865639,5383109,7619130,33073494,72040253,11935411
1990-01-01,272690813,136582146,17527048,119053499,211664,998827,5748930,10568963,26750015,77679366,14624418
2000-01-01,307006550,115012044,13968056,100944369,163068,922499,4230366,8652124,21565176,67970291,11412834
2010-01-01,318857056,50167967,6072017,44095950,72867,421059,1749809,3764142,10125170,30401698,3569080

Bonus Question: What is the most dangerous decade to live in the US?

In [41]:
# Find the decade with the highest total number of violent crimes
most_dangerous_decade = decade_sum['Violent'].idxmax()
most_violent_crimes = decade_sum['Violent'].max()

print(f"The most dangerous decade to live in the US is the {most_dangerous_decade.year}s with {most_violent_crimes} violent crimes.")

The most dangerous decade to live in the US is the 1990s with 17527048 violent crimes.

### **PART 5 - MERGE/JOIN**

For this one, we will create our own dataset. Yayy âœ¨

We will be dealing with both Numpy and Pandas in this one.

Step 1. Import the necessary libraries

In [42]:
import numpy as np
import pandas as pd

Step 2. **Create 3 differents Series, each of length 100, as follows:**

1. The first a random number from 1 to 4

2. The second a random number from 1 to 3

3. The third a random number from 10,000 to 30,000

In [43]:
#name them s1,s2,s3
# Create 3 different Series
# First series: random numbers from 1 to 4
s1 = pd.Series(np.random.randint(1, 5, size=100), name="s1")

# Second series: random numbers from 1 to 3
s2 = pd.Series(np.random.randint(1, 4, size=100), name="s2")

# Third series: random numbers from 10,000 to 30,000
s3 = pd.Series(np.random.randint(10000, 30001, size=100), name="s3")

print("Series s1:\n", s1.head(), "\n")
print("Series s2:\n", s2.head(), "\n")
print("Series s3:\n", s3.head(), "\n")

Series s1:
 0    4
1    1
2    1
3    4
4    3
Name: s1, dtype: int32

Series s2:
 0    2
1    3
2    1
3    3
4    2
Name: s2, dtype: int32

Series s3:
 0    21847
1    20107
2    10858
3    19216
4    13252
Name: s3, dtype: int32

Step 3. Let's create a DataFrame by joinning the Series by column.

In [44]:
#try concat, but figure out the axis on your own :)
df = pd.concat([s1, s2, s3], axis=1)
df.head()

   s1  s2     s3
0   4   2  21847
1   1   3  20107
2   1   1  10858
3   4   3  19216
4   3   2  13252

Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [45]:
# Rename the columns
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']

# Display the DataFrame with new column names
df.head()

   bedrs  bathrs  price_sqr_meter
0      4       2            21847
1      1       3            20107
2      1       1            10858
3      4       3            19216
4      3       2            13252

Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [46]:
#join concat the values but still change the series into a food as well
# Concatenate the values of the 3 Series along rows
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# Convert the result into a DataFrame
bigcolumn = bigcolumn.to_frame(name='bigcolumn')

Oops, it seems it is going only until index 99. Is it true?

In [47]:
bigcolumn

    bigcolumn
0           4
1           1
2           1
3           4
4           3
..        ...
95      23878
96      16867
97      13281
98      13498
99      15057

[300 rows x 1 columns]

Step 6. Reindex the DataFrame so it goes from 0 to 299

In [48]:
bigcolumn.reset_index(drop=True, inplace=True)
print(bigcolumn.head(15))
print(bigcolumn.tail(15))
print(bigcolumn.shape)

    bigcolumn
0           4
1           1
2           1
3           4
4           3
5           1
6           2
7           2
8           4
9           4
10          4
11          2
12          3
13          1
14          1
     bigcolumn
285      15028
286      17142
287      17337
288      24246
289      18363
290      25574
291      23964
292      10236
293      23768
294      12961
295      23878
296      16867
297      13281
298      13498
299      15057
(300, 1)

### ***TA-DA. That's it. THE END!***